fedetft/miosix-kernel-unofficial/miosix/arch/common/drivers/transceiver_CC2520.cpp
/***************************************************************************
 *   Copyright (C) 2012, 2013, 2014, 2015, 2016, 2022                      *
 *      by Terraneo Federico, Luigi Rinaldi and Alessandro Sorrentino      *
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 *   This program is distributed in the hope that it will be useful,       *
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of        *
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the         *
 *   GNU General Public License for more details.                          *
 *                                                                         *
 *   As a special exception, if other files instantiate templates or use   *
 *   macros or inline functions from this file, or you compile this file   *
 *   and link it with other works to produce a work based on this file,    *
 *   this file does not by itself cause the resulting work to be covered   *
 *   by the GNU General Public License. However the source code for this   *
 *   file must still be made available in accordance with the GNU General  *
 *   Public License. This exception does not invalidate any other reasons  *
 *   why a work based on this file might be covered by the GNU General     *
 *   Public License.                                                       *
 *                                                                         *
 *   You should have received a copy of the GNU General Public License     *
 *   along with this program; if not, see <http://www.gnu.org/licenses/>   *
 ***************************************************************************/ 

#include "transceiver_CC2520.h"
#include "cc2520_constants.h"
#include "interfaces/gpio.h"
#include "config/miosix_settings.h"
#include <stdexcept>
#include <algorithm>
#include <cassert>
#include <kernel/scheduler/scheduler.h>
#include "interfaces-impl/time_types_spec.h"

using namespace std;
using namespace miosix::events;

namespace miosix {


/**
 * NOTE: after implementing the driver for this transceiver, it was clear that
 * the hardware is designed assuming a reactive or event-driven paradigm,
 * where the handling of events or "exceptions", as called in the datasheet,
 * is separated from the individual actions, such as transmit or receive.
 * This driver, which is meant for deterministic time-slotted protocols, offers
 * instead an imperative interface with individual transmit and receive
 * operations depending on the task to be performed in a given time slot.
 * Due to the mismatch between what the hardware provides and what the software
 * requires, the driver is a bit complicated, and feels like fitting a square
 * peg in a round hole.
 */

using complExcChB=transceiver::gpio2; ///< Function of this pin is missing in bsp

//
// Time constants computation
//

/// Wait time for the RSSI to become valid
const auto rssiWait=80000;

/// Slack added to all constants ending in "timeout"
const auto slack=128000;

/// Transceiver activation time (time from idle to TX or RX, and from RX to TX)
/// Measured STXON to SFD_TX delay (turnaround+preambleSfdTime) is 352.370us
const auto turnaround=192370;

/// Measured SFD_TX to SFD_RX delay 
const auto rxSfdLag=3374;

/// Time to send one byte as float
const auto timePerByte=32000;

/// Time to send the first part of each packet (4 bytes preamble + 1 byte SFD)
const auto preambleSfdTime=timePerByte*5;

/// Timeout from sending STXON to when the SFD should be sent, around 500us
const auto sfdTimeout=slack+turnaround+preambleSfdTime;

/// Timeout from an SFD to when the maximum length packet should end
const auto maxPacketTimeout=slack+timePerByte*128;

/**
 * Used by the SPI code to respect tcscks, csckh, tcsnh
 * defined at page 34 of the CC2520 datasheet
 */
static inline void spiDelay()
{
    asm volatile("           nop    \n"
                 "           nop    \n"
                 "           nop    \n");
}

/**
 * RAII class to keep the transceiver SPI chip select low in a scope
 */
class TransceiverChipSelect
{
public:
    TransceiverChipSelect()
    {
        transceiver::cs::low();
        spiDelay();
    }
    
    ~TransceiverChipSelect()
    {
        spiDelay();
        transceiver::cs::high();
        spiDelay();
    }
};

//
// class TransceiverConfiguration
//

void TransceiverConfiguration::setChannel(int channel)
{
    if(channel<11 || channel>26) throw range_error("Channel not in range");
    frequency=2405+5*(channel-11);
}

//
// class Transceiver
//

const int Transceiver::minFrequency = 2405;
const int Transceiver::maxFrequency = 2480;

Transceiver& Transceiver::instance()
{
    static Transceiver singleton;
    return singleton;
}

void Transceiver::IRQturnOn()
{
    if(state!=CC2520State::DEEPSLEEP) return;

    //Enable the transceiver power domain
    enableTransceiverPowerDomain();
    transceiver::reset::high();
    
    {
        TransceiverChipSelect cs;
        //wait until SO=1 (clock stable and running)
        waitXosc();
    }
    
    configure();
}

void Transceiver::configure()
{
    //
    // Configure transceiver as per given configuration class
    //
    
    writeReg(CC2520Register::FREQCTRL,config.frequency-2394);
    writeReg(CC2520Register::FRMCTRL0,0x40*config.crc); //automatically add FCS
    writeReg(CC2520Register::TXPOWER,txPower(config.txPower));
    
    //
    // GPIO and exception configuration
    //

    //Setting SFD, TX_FRM_DONE, RX_FRM_DONE, RX_OVERFLOW on exception channel B
    writeReg(CC2520Register::EXCMASKB0,   CC2520Exception::TX_FRM_DONE
                                        | CC2520Exception::RX_OVERFLOW);
    writeReg(CC2520Register::EXCMASKB1,(  CC2520Exception::RX_FRM_DONE
                                        | CC2520Exception::SFD)>>8);
    writeReg(CC2520Register::EXCMASKB2,0x0);
    
    //Setting gpio0 as no function input to save power (breaks bed of nail test)
    writeReg(CC2520Register::GPIOCTRL0,0x80 | 0x10);
    //Setting gpio2 as output complementary exception channel B
    writeReg(CC2520Register::GPIOCTRL2,0x24);
    //Setting gpio3 as output exception channel B
    writeReg(CC2520Register::GPIOCTRL3,0x22);
    //Setting gpio5 as input on rising edge send command strobe STXON
    writeReg(CC2520Register::GPIOCTRL5,0x80 | 0x08);
    
    //
    // MISC configuration
    //
    
