fedetft/miosix-kernel-unofficial/miosix/arch/common/drivers/transceiver_CC2520.cpp
    if(handlePacketReceptionEvents(timeout,size,result)==false)
         readPacketFromRxBuffer(pkt,size,result);
    return result;
}

short Transceiver::readRssi()
{
    startRxAndWaitForRssi();
    return decodeRssi(readReg(CC2520Register::RSSI));
}

void Transceiver::writeReg(CC2520Register reg, unsigned char data)
{
    unsigned char r=toByte(reg);
    assert(r<=0x7e);
    
    TransceiverChipSelect cs;
    if(r<0x40)
    {
        spi.sendRecv(toByte(CC2520Command::REGISTER_WRITE) | r);
    } else {
        spi.sendRecv(toByte(CC2520Command::MEMORY_WRITE));
        spi.sendRecv(r);
    }
    spi.sendRecv(data);
}
    
unsigned char Transceiver::readReg(CC2520Register reg)
{
    unsigned char r=toByte(reg);
    assert(r<=0x7e);
    
    TransceiverChipSelect cs;
    if(r<0x40)
    {
        spi.sendRecv(toByte(CC2520Command::REGISTER_READ) | r);
    } else {
        spi.sendRecv(toByte(CC2520Command::MEMORY_READ));
        spi.sendRecv(r);
    }
    return spi.sendRecv();
}

CC2520StatusBitmask Transceiver::commandStrobe(CC2520Command cmd)
{
    TransceiverChipSelect cs;
    return spi.sendRecv(toByte(cmd));
}

Transceiver::Transceiver() : spi(Spi::instance()), state(CC2520State::DEEPSLEEP), 
                                waiting(nullptr), transceiverPowerDomainRefCount(0)
{
    registerGpioIrq(internalSpi::miso::getPin(), GpioIrqEdge::RISING,
    [this]{
        if(!waiting) return;
        waiting->IRQwakeup();
        if(waiting->IRQgetPriority()>Thread::IRQgetCurrentThread()->IRQgetPriority())
            Scheduler::IRQfindNextThread();
        waiting=nullptr;
    });
}

void Transceiver::startRxAndWaitForRssi()
{
    DeepSleepLock dslck;

    if(state!=CC2520State::RX)
    {
        commandStrobe(CC2520Command::SRXON);
        state=CC2520State::RX;
    }
    //We should do this even if we are already in RX, as we may be in RX for
    //such a short time (such as two sendCca() back to back, that the RSSI is
    //not yet valid
    
    //The datasheet says the maximum time for the RSSI to become valid is
    //the time for the receiver to start (192us) plus the time to receive
    //8 symbols (128us), the total is 320us, so we wait for a maximum of
    //8 * 80us, or 640us
    const int retryTimes=8;
    for(int i=0;i<retryTimes;i++)
    {
        CC2520StatusBitmask status=commandStrobe(CC2520Command::SNOP);
        if(status & CC2520Status::RSSI_VALID) break;
        if(i==retryTimes-1)
            throw runtime_error("Transceiver::startRxAndWaitForRssi timeout");
        // dummy channel and eventDirection, just wait for timeout
        waitEvent(rssiWait, Channel::SFD_STXON); 
    }
}

void Transceiver::writePacketToTxBuffer(const void* pkt, int size)
{
    //Input param validation
    if(size<1)
        throw range_error("Transceiver::writePacketToTxBuffer packet too short");
    if(size>(config.crc ? 125 : 127))
        throw range_error("Transceiver::writePacketToTxBuffer packet too long");
    
    //Send packet to the transceiver
    {
        TransceiverChipSelect cs;
        spi.sendRecv(toByte(CC2520Command::TXBUF));
        spi.sendRecv(size+(config.crc ? 2 : 0));
        const unsigned char *ptr=reinterpret_cast<const unsigned char *>(pkt);
        for(int i=0;i<size;i++) spi.sendRecv(*ptr++);
    }
    
    //Look for unexpected exceptions
    if(complExcChB::value())
    {
        unsigned int exc=getExceptions(0b001);
        if(exc & CC2520Exception::TX_OVERFLOW)
        {
            //See diagram on page 69 of datasheet
            commandStrobe(CC2520Command::SFLUSHTX);
            clearException(CC2520Exception::TX_OVERFLOW);
            throw runtime_error("Transceiver::writePacketToTxBuffer tx overflow");
        }
    }
}

void Transceiver::handlePacketTransmissionEvents(int size)
{   
    DeepSleepLock dslck;

    bool oneRestart=false;
    bool silentError=false;
    restart:
    //Wait for the first event to occur (SFD)
    if(waitEvent(sfdTimeout, Channel::SFD_STXON).first != EventResult::EVENT)
    {
        //In case of timeout, abort current transmission
        idle();
        throw runtime_error("Transceiver::handlePacketTransmissionEvents timeout 1");
    }

    unsigned int exc=getExceptions(0b111);
    if(exc & CC2520Exception::SFD)
    {
        clearException(CC2520Exception::SFD);
    }
    //Both exception can occur simultaneously if a context switch occurs causing
    //an unexpected delay
    if(exc & CC2520Exception::TX_FRM_DONE)
    {
        //If both exceptions have occurred, then clear also the second one and
        //return without waiting any longer
        clearException(CC2520Exception::TX_FRM_DONE);
        if(silentError) idle();
        return;
    }
    //These are the odd ones caused by a race condition happening when we
    //transmit without first turning off the receiver, which for STXONCCA is
    //a necessity. If an unread packet is in the RX fifo, the RX_FRM_DONE
    //is set and this keeps exc ch B active, so we need to clear the RX
    //exception even though we are in TX. Same for RX_OVERFLOW, but we also
    //need to recover from the error, and do so AFTER we have sent the packet
    if(exc & CC2520Exception::RX_FRM_DONE)
    {
        if(oneRestart)
        {
            idle();
            throw runtime_error("Transceiver::handlePacketTransmissionEvents rx frm done");
        }
        oneRestart=true;
        clearException(CC2520Exception::RX_FRM_DONE);
        goto restart;
    }
    if(exc & CC2520Exception::RX_OVERFLOW)
    {
        if(oneRestart)
        {
            idle();
            throw runtime_error("Transceiver::handlePacketTransmissionEvents rx overflow");
        }
        oneRestart=true;
        clearException(CC2520Exception::RX_OVERFLOW);
        silentError=true;
        goto restart;
    }
    
    //Wait for the second event to occur (TX_FRM_DONE)
    bool timeout=waitEvent(maxPacketTimeout, Channel::SFD_STXON).first == EventResult::EVENT_TIMEOUT;

    exc=getExceptions(0b001);
    if(timeout==true || (exc & CC2520Exception::TX_FRM_DONE)==0)
    {
        //In case of timeout, abort current transmission
        idle();
        //One cause (that should not happen anyway) of hitting the timeout
        //is the tx underflow exception
        if(exc & CC2520Exception::TX_UNDERFLOW)
            throw runtime_error("Transceiver::handlePacketTransmissionEvents tx underflow");
        if(timeout)
            throw runtime_error("Transceiver::handlePacketTransmissionEvents timeout 2");
        throw runtime_error("Transceiver::handlePacketTransmissionEvents no frm done");
    }
    clearException(CC2520Exception::TX_FRM_DONE);
    if(silentError) idle();
}

