fedetft/miosix-kernel-unofficial/miosix/arch/common/drivers/transceiver_CC2520.cpp
    DeepSleepLock dslck;

    auto misoPin=internalSpi::miso::getPin();
    FastInterruptDisableLock dLock;
    waiting=Thread::IRQgetCurrentThread();
    IRQenableGpioIrq(misoPin);
    do {
        Thread::IRQwait();
        {
            FastInterruptEnableLock eLock(dLock);
            Thread::yield();
        }
    } while(waiting);
    IRQdisableGpioIrq(misoPin);
}

unsigned char Transceiver::txPower(int dBm)
{
    CC2520TxPower result;
    if(dBm>=5)       result=CC2520TxPower::P_5;
    else if(dBm>=3)  result=CC2520TxPower::P_3;
    else if(dBm==2)  result=CC2520TxPower::P_2;
    else if(dBm==1)  result=CC2520TxPower::P_1;
    else if(dBm==0)  result=CC2520TxPower::P_0;
    else if(dBm>=-2) result=CC2520TxPower::P_m2;
    else if(dBm>=-7) result=CC2520TxPower::P_m7;
    else             result=CC2520TxPower::P_m18;
    return toByte(result);
}

short int Transceiver::decodeRssi(unsigned char reg)
{
    int rawRssi=static_cast<int>(reg);
    if(rawRssi & 0x80) rawRssi-=256; //8 bit 2's complement to int
    return rawRssi-76; //See datasheet
}

inline std::pair<EventResult, long long> Transceiver::waitEvent(long long timeoutNs, Channel channel)
{
    //cap maximum absolute ns value to __LONG_LONG_MAX__
    long long now;
    {
        FastInterruptDisableLock dLock;

        now = IRQgetTime();
        if (timeoutNs > (std::numeric_limits<long long>::max() - now))
            timeoutNs = std::numeric_limits<long long>::max() - now;
    }
    // absolute wait 
    // note: if interrupts preempt this up to the point where the absoluteTime is 
    // in the past, absoluteWaitEvent will handle this
    return absoluteWaitEvent(getTime() + timeoutNs, channel);
}

inline std::pair<EventResult, long long> Transceiver::absoluteWaitEvent(long long absoluteTimeoutNs, Channel channel)
{
    // FIXME: (s) can't divide in both, division returns zero
    /*static constexpr long long oneTick2Ns = 1 / EFM32_HFXO_FREQ; // 20 (.8) ns
    static constexpr unsigned int minTimeDiff = 200 / EFM32_HFXO_FREQ;

    // TODO: (s) spostare in timer! + ricalcolare 
    // resolve event result without wait (if possible) and configure transceiver for event
    long long curentTimeNs = getTime(); // This require almost 1us about 50ticks
    long long timeDiff = absoluteTimeoutNs-curentTimeNs;
    absoluteTimeoutNs -= oneTick2Ns;
    
    bool wakeUpInThePast = false;
    if(timeDiff > minTimeDiff)
    {
        unsigned short t1=static_cast<unsigned short>(tick & 0xFFFF);
        //ms32chkp[0] is going to store even the middle part, because we don't need to use TIMER3
        // ms32chkp[0] = tick & (upperMask | 0xFFFF0000);
        // TIMER2->CC[1].CCV = t1;

        // enableCC1InterruptTim2(true);
        wakeUpInThePast = true;
    }

    // setModeTransceiverTimer(true);
    // cleanBufferTrasceiver();
    // enableCC0InterruptTim3(false); //enableCC0Interrupt
    // enableCC0InterruptTim2(true);
    */
    if(transceiver::excChB::value()){
        // read captured timer value
        long long timestampTick = hsc->upperTimeTick | Hsc::IRQgetEventTimestamp();
        long long timestampNs = hsc->tc.tick2ns(timestampTick);

        // return event
        return std::make_pair(EventResult::EVENT, timestampNs);
    }

    /*
    if(wakeUpInThePast){
        // enableCC0InterruptTim2(false);
        // enableCC1InterruptTim2(false);

        return EventResult::EVENT_IN_THE_PAST;
    }*/

    // configure event wait
    configureEvent(channel, EventDirection::INPUT);
    // wait for event
    auto eventResultPack = events::absoluteWaitEvent(channel, absoluteTimeoutNs);
    // deconfigure event wait
    configureEvent(channel, EventDirection::DISABLED);

    return eventResultPack;
}

inline EventResult Transceiver::triggerEvent(long long ns, Channel channel)
{
    //cap maximum absolute ns value to __LONG_LONG_MAX__
    long long now;
    {
        FastInterruptDisableLock dLock;

        now = IRQgetTime();
        if (ns > (std::numeric_limits<long long>::max() - now))
            ns = std::numeric_limits<long long>::max() - now;
    }
    // absolute trigger 
    // note: if interrupts preempt this up to the point where the absoluteTime is 
    // in the past, absoluteTriggerEvent will handle this
    return absoluteTriggerEvent(getTime() + ns, channel);
}

inline EventResult Transceiver::absoluteTriggerEvent(long long absoluteNs, Channel channel)
{
    // configure event wait
    configureEvent(channel, EventDirection::OUTPUT);
    // wait for event
    EventResult eventResult = events::absoluteTriggerEvent(channel, absoluteNs);
    // deconfigure event wait
    configureEvent(channel, EventDirection::DISABLED);

    return eventResult;
}

void Transceiver::enableTransceiverPowerDomain()
{
    Lock<FastMutex> plock(powerMutex);

    if(transceiverPowerDomainRefCount == 0)
    {
        //Enable power domain
        transceiver::vregEn::high();
        transceiver::reset::low();
        
        //The voltage at the the flash rises in about 70us,
        //observed using an oscilloscope. The voltage at the
        //transceiver is even faster, but the spec says 100us
        //TODO: power hungry, but we can't use the rtc as only one thread
        //can use it at a time, and we may be called by another thread
        delayUs(100);
        
        transceiver::cs::high();

        flash::cs::high();
        flash::hold::high();
        
        spi.enable();
    }

    ++transceiverPowerDomainRefCount;
}

void Transceiver::disableTransceiverPowerDomain()
{
    Lock<FastMutex> plock(powerMutex);

    --transceiverPowerDomainRefCount;

    if(transceiverPowerDomainRefCount==0)
    {
        //Disable power domain
        spi.disable();
        
        flash::hold::low();
        flash::cs::low();
        
        transceiver::reset::low();
        transceiver::cs::low();
        
        transceiver::vregEn::low();
    } else if(transceiverPowerDomainRefCount<0) {
        throw runtime_error("transceiver power domain refcount is negative");
    }
}

} //namespace miosix
